shan-hongzhi/MIOT-RTL8762E-B12G/vendor/xiaomi/mijia_ble_mesh/src/board/rtl8762e/main_lpn.c
/* main.c - Application main entry point */

/*
 * Copyright (c) 2015-2016 Intel Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/types.h>
#include <string.h>
#include <malloc.h>
#include <errno.h>
#include <kernel.h>
#include <sys/byteorder.h>
#include <sys/ioctl.h>
#include <sys/crc.h>
#include <fcntl.h>

#include <settings/settings.h>
#include <net/buf.h>
#include <bluetooth/bluetooth.h>
#include <bluetooth/hci.h>
#include <bluetooth/conn.h>
#include <bluetooth/uuid.h>
#include <bluetooth/gatt.h>
#include <bluetooth/mesh.h>
#include <nuttx/timers/watchdog.h>
#include <../../subsys/bluetooth/host/hci_core.h>
#include <../../subsys/bluetooth/mesh/access.h>

#include "main.h"
#include "mible.h"
#include "mible_mesh.h"
#include "mible_spec.h"
#include "mible_user_api.h"
#include "miio_user_api.h"
#include "mesh_vnd_lpn.h"
#include "mesh_vnd_df.h"
#include "mible_trace.h"

#include "rtl876x.h"
#include "rtl876x_gpio.h"
#include "rtl876x_tim.h"
#include "rtl876x_pinmux.h"
#include "rtl876x_rcc.h"
#include "rtl876x_nvic.h"
#include "rtl876x_bitfields.h"
#include "dlps.h"

#if defined(MI_LOG_ENABLED) && (MI_LOG_ENABLED)
#include <sys/printk.h>
#else
#undef printk
#define printk(fmt, ...)
#endif

#define PRODUCT_ID                      19274
#define MODEL_NAME                      "xiaomi.switch.mesh2"

#define DEVELOPER_VERSION               199

#define TEST_GATT_SPEC                  0

#define SWITCH_POWER_ON_COUNT           4
#define SWITCH_POWER_ON_TIME            8000 //!< millisecond
#define RECORD_ID_POWER_ON_COUNT        0
#define RECORD_ID_LIGHT_ON_STATE        1


static void *pwn_timer;
static void *app_handle;
static void *reset_timer;
static void *conn_timer;

static bool is_connected = false;
static bool is_logined = false;
static bool is_provisioned = false;

static uint8_t gatt_spec_buffer[1024];
static struct mible_gatt_spec_tx gatt_spec_pool[5];
const volatile struct mible_config mi_config;

/* Config WatchDog*/
static int fd_wd;
struct board_ctl {
    unsigned long req;
    unsigned long val;
};

static const struct board_ctl wdog_ctls[] = {
    { WDIOC_SETTIMEOUT, 20 * 1000 },
    { WDIOC_START, 0 },
};

static const struct {
    int *fd;
    const char *dev_path;
    int oflag;
    const struct board_ctl *ctls;
    uint32_t ctls_count;
} hw_drivers[] = {
    { &fd_wd,    "/dev/watchdog0", O_RDONLY, wdog_ctls, ARRAY_SIZE(wdog_ctls) },
};

static int wdg_init(void)
{
    int err = 0;

    for (int i = 0; i < ARRAY_SIZE(hw_drivers); i++) {
        int fd = open(hw_drivers[i].dev_path, hw_drivers[i].oflag);
        if (fd < 0) {
            printk("%s open failed\n", hw_drivers[i].dev_path);
            return fd;
        }

        *hw_drivers[i].fd = fd;

        for (int j = 0; j < hw_drivers[i].ctls_count; j++) {
            err = ioctl(fd, hw_drivers[i].ctls[j].req, hw_drivers[i].ctls[j].val);
            if (err < 0) {
                printk("%s ioctl req %ld val %ld err:%d\n", hw_drivers[i].dev_path,
                    hw_drivers[i].ctls[j].req, hw_drivers[i].ctls[j].val, err);
                return err;
            }
        }
    }

    return err;
}

#define BT_ADV_SCAN_UNIT(_ms) ((_ms) * 8 / 5)

/*
 * Set Advertisement data. Based on the Eddystone specification:
 * https://github.com/google/eddystone/blob/master/protocol-specification.md
 * https://github.com/google/eddystone/tree/master/eddystone-url
 */
static const struct bt_data ad[] = {
    BT_DATA_BYTES(BT_DATA_FLAGS, BT_LE_AD_NO_BREDR),
    BT_DATA_BYTES(BT_DATA_UUID16_ALL, 0xaa, 0xfe),
    BT_DATA_BYTES(BT_DATA_SVC_DATA16,
              0xaa, 0xfe, /* Eddystone UUID */
              0x10, /* Eddystone-URL frame type */
              0x00, /* Calibrated Tx power at 0m */
              0x00, /* URL Scheme Prefix http://www. */
              'z', 'e', 'p', 'h', 'y', 'r',
              'p', 'r', 'o', 'j', 'e', 'c', 't',
              0x08) /* .org */
};

int mible_gap_user_noconn_adv_start(uint32_t adv_interval, uint8_t count, const struct bt_data *ad,
                    size_t ad_len)
{
    static struct bt_le_ext_adv *g_user_adv = NULL;

    struct bt_le_adv_param param = {
        .interval_min = BT_ADV_SCAN_UNIT(adv_interval),
        .interval_max = BT_ADV_SCAN_UNIT(adv_interval),
        .options = BT_LE_ADV_OPT_USE_IDENTITY,
    };
    struct bt_le_ext_adv_start_param start = {
        .num_events = count,
    };
    int err;
#if defined(CONFIG_BT_MESH_STATISTIC)
    mible_trace_update_user_adv_cnt(count);
#endif
    if (!g_user_adv) {
        err = bt_le_ext_adv_create(&param, NULL, &g_user_adv);
        if (err) {
            printk("adv create failed (err %d)\n", err);
            return -EINVAL;
        }
    }

    if (atomic_test_bit(g_user_adv->flags, BT_ADV_ENABLED)) {
        return -EBUSY;
    }

    err = bt_le_ext_adv_update_param(g_user_adv, &param);
    if (err) {
        printk("Unable set adv params\n");
        return err;
    }

    err = bt_le_ext_adv_set_data(g_user_adv, ad, ad_len, NULL, 0);
    if (err) {
        printk("Unable set adv data\n");
        return err;
    }

    err = bt_le_ext_adv_start(g_user_adv, &start);
    if (err) {
        printk("Unable start adv\n");
        return err;
    }

    return 0;
}

// xiaomi mesh develop board (B12G) pin map
#define LED1_R              P2_4
#define LED2_G              P2_5
#define LED3_B              P2_6
#define LED4_C              P0_2
#define LED5_W              P0_1

#define BUTTON_0            P4_2
#define GPIO_PIN_BUTTON_0   GPIO_GetPin(BUTTON_0)
#define GPIO_BUTTON0_IRQn    GPIO30_IRQn
#define GPIO_BUTTON0_Handler GPIO30_Handler
#define BUTTON_1            P4_1
#define GPIO_PIN_BUTTON_1   GPIO_GetPin(BUTTON_1)
#define GPIO_BUTTON1_IRQn    GPIO29_IRQn
#define GPIO_BUTTON1_Handler GPIO29_Handler

#define BUTTON_2            P4_0
#define GPIO_PIN_BUTTON_2   GPIO_GetPin(BUTTON_2)
#define GPIO_BUTTON2_IRQn    GPIO13_IRQn
#define GPIO_BUTTON2_Handler GPIO13_Handler

switch_demo_t two_key_switch = {
    .left_on = false,
    .left_mode = 0,
    .fault = 0,
    .anti_flk = 0,
    .right_on = false,
    .right_mode = 0,
    .anti_flk = false,
    .power_consumption = 5.0,
    .power_electric = 200,
    .accumulation = true,
    .gmt_offset = 0,
    .weather = 0,
    .utc_time = 0,
};

int key1_onoff_set(bool on)
{
    printk("key1 %s!\n", on? "on" : "off");

    two_key_switch.left_on = on;
    Pad_Config(LED1_R, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, on ? PAD_OUT_HIGH : PAD_OUT_LOW);

