shan-hongzhi/MIOT-RTL8762E-B12G/vendor/xiaomi/mijia_ble_mesh/src/board/rtl8762e/main_lpn.c
    return 0;
}

int key2_onoff_set(bool on)
{
    two_key_switch.right_on = on;
    Pad_Config(LED2_G, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, on ? PAD_OUT_HIGH : PAD_OUT_LOW);

    return 0;
}

void user_scan_check(void)
{
    if(is_provisioned){
        if(two_key_switch.anti_flk || is_connected){
            // if flk mode or connected, set scan low mode(15%)
            miio_mesh_set_scan_level(MESH_SCAN_LOW);
        }else{
            // set scan normal mode(20%)
            miio_mesh_set_scan_level(MESH_SCAN_NORMAL);
        }
    }else{
        // if need scan when unprov, set scan low mode(15%)
        miio_mesh_set_scan_level(MESH_SCAN_NORMAL);
    }
}

#if TEST_GATT_SPEC
const char *str1 = "Hi, Susan, We re throwing a surprise party for Xiaomings birthday. \
As scheduled, all the classmates in our class will gather at the Students  Centre at \
8 pm this Friday evening to celebrate Xiaoming s birthday. We would feel much honored \
if you could come and enjoy it, which is to finish at 9, lasting an hour. As the party \
starts, we will light the candles and sing Happy Birthday for him. Then the birthday \
cake will be presented and cut for all of us to enjoy, following which we ll sing songs \
and play some small games. What s more, as a surprise, we ll all prepare some secret \
birthday gifts for him, and it ll be great to see how surprised he will be seeing the \
gifts. As it s a surprise party, he will know nothing about it beforehand, and we do hope\
that you could manage to attend it. Looking forward to your coming. Yours Li Hua";

void gatt_prop()
{
    int ret;
    if(is_connected){
        mible_spec_property_t Props;
        Props.siid = 1;Props.piid = 2; 
        mible_spec_property_value_new_uchar(&Props.value, 80);
        miio_gatt_properties_changed(1, &Props);

        Props.siid = 2;Props.piid = 4; 
        mible_spec_property_value_new_float(&Props.value, -12.3f);
        miio_gatt_properties_changed(1, &Props);

        Props.siid = 3;Props.piid = 6; 
        mible_spec_property_value_new_string(&Props.value, "abcdefg1234567!");
        miio_gatt_properties_changed(1, &Props);


        mible_spec_property_t newProps[5];
        newProps[0].siid = 1;newProps[0].piid = 2; 
        mible_spec_property_value_new_uchar(&newProps[0].value, 80);
        newProps[1].siid = 1;newProps[1].piid = 2; 
        mible_spec_property_value_new_uchar(&newProps[1].value, 100);
        newProps[2].siid = 2;newProps[2].piid = 4; 
        mible_spec_property_value_new_float(&newProps[2].value, -12.3f);
        newProps[3].siid = 2;newProps[3].piid = 4; 
        mible_spec_property_value_new_float(&newProps[3].value, 23.4f);
        newProps[4].siid = 3;newProps[4].piid = 6; 
        mible_spec_property_value_new_string(&newProps[4].value, str1);
        ret = miio_gatt_properties_changed(5, newProps);
        printk("%s[%d]ret=%d strlen(str1)=%d\n", __FUNCTION__, __LINE__, ret, strlen(str1));
    }
}

void gatt_event()
{
    if(is_connected){
        //5-1006 Door Ring
        miio_gatt_event_occurred(5, 1006, NULL);
        //2-1007 Lock abnormal
        mible_spec_arguments_t newArgs;
        mible_spec_argument_t arguments[2];
        newArgs.size = 2;
        newArgs.arguments = arguments;
        arguments[0].piid = 4;
        mible_spec_property_value_new_uchar(&arguments[0].value, 3);
        arguments[1].piid = 6;
        mible_spec_property_value_new_string(&arguments[1].value, "abcdefghijklmnopqrstuvwxyz1234567890!!!");
        miio_gatt_event_occurred(2, 1007, &newArgs);
    }
}
#endif

static void button_process_handler(void *args)
{
    printk("button pressed!\n");

    mible_gap_user_noconn_adv_start(20, 8, ad, ARRAY_SIZE(ad));

    two_key_switch.left_on = two_key_switch.left_on? false:true;
    key1_onoff_set(two_key_switch.left_on);

    if(is_provisioned){
        // first upload button event for automation
        miio_mesh_event_occurred(3, 1, NULL);

        mible_spec_property_value_t value;
        mible_spec_property_value_new_boolean(&value, two_key_switch.left_on);
        miio_mesh_properties_changed(2, 1, &value);
#if TEST_GATT_SPEC
        gatt_prop();
        gatt_event();
#endif
    }
}

#if defined(CONFIG_PM)
#define DATA_RAM_FUNCTION  __attribute__((section(".app.data_ram.text")))
static uint32_t gpio_storereg[10];
bool IO_DLPS_Enter_Allowed = true;

DATA_RAM_FUNCTION
static bool gpio_check_dlps(uint32_t *timeout)
{
    return IO_DLPS_Enter_Allowed;
}

DATA_RAM_FUNCTION
static void gpio_enter_dlps(void)
{
  RCC_PeriphClockCmd(APBPeriph_GPIO, APBPeriph_GPIO_CLOCK, ENABLE);

  memcpy((uint32_t *)&gpio_storereg[0], (uint32_t *)&GPIO->DATAOUT, 12);
  memcpy((uint32_t *)&gpio_storereg[3], (uint32_t *)&GPIO->INTEN, 16);

  gpio_storereg[7] = GPIO->DEBOUNCE;
  gpio_storereg[8] = *(__IO uint32_t *)(0x40000344UL);
  gpio_storereg[9] = GPIO->INTBOTHEDGE;

  /* for evb weakup */
  // config this pin (pad) to software mode: waiting ext interrupt to wakeup.
  Pad_Config(BUTTON_0, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_LOW);

  extern void System_WakeUpDebounceTime(uint8_t time);
  System_WakeUpDebounceTime(10);
  // use this pin to wakeup the chip from Deep Low Power Mode.
  if (GPIO_ReadInputDataBit(GPIO_PIN_BUTTON_0)){
    System_WakeUpPinEnable(BUTTON_0, PAD_WAKEUP_POL_LOW, PAD_WK_DEBOUNCE_DISABLE, 0);
  }else{
    System_WakeUpPinEnable(BUTTON_0, PAD_WAKEUP_POL_HIGH, PAD_WK_DEBOUNCE_DISABLE, 0);
  }
}

DATA_RAM_FUNCTION
static void gpio_exit_dlps(void)
{
  RCC_PeriphClockCmd(APBPeriph_GPIO, APBPeriph_GPIO_CLOCK, ENABLE);

  memcpy((uint32_t *)&GPIO->DATAOUT, (uint32_t *)&gpio_storereg[1], 8);

  memcpy((uint32_t *)&GPIO->INTMASK, (uint32_t *)&gpio_storereg[4], 12);

  GPIO->DEBOUNCE      = gpio_storereg[7];
  GPIO->DATAOUT       = gpio_storereg[0];
  GPIO->INTCLR        = ~(gpio_storereg[1]);
  GPIO->INTEN         = gpio_storereg[3];
  *(__IO uint32_t *)(0x40000344UL) = gpio_storereg[8];
  GPIO->INTBOTHEDGE = gpio_storereg[9];

