shan-hongzhi/MIOT-RTL8762E-B12G/vendor/xiaomi/mijia_ble_mesh/src/board/rtl8762e/main_lpn.c
  /* for evb weakup */
  // config this pin (pad) to muxplexing mode.
  Pad_Config(BUTTON_0, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_HIGH);
}

DATA_RAM_FUNCTION
static void gpio_wakeup_dlps(void)
{
  NVIC_DisableIRQ(System_IRQn);

  if (System_WakeUpInterruptValue(BUTTON_0) == SET)
  {
    Pad_ClearWakeupINTPendingBit(BUTTON_0);
    System_WakeUpPinDisable(BUTTON_0);
    IO_DLPS_Enter_Allowed = false;
  }

  // MUST clear debounce bit here.
  __rtl_btaon_fast_write_safe_8b(0x2b, (__rtl_btaon_fast_read_safe_8b(0x2b) | BIT7));
  NVIC_ClearPendingIRQ(System_IRQn);
}

static struct dlps_driver_ops rtl_pm_driver_ops[]
    __attribute__((section(".dlps.dataon.data")))
    __attribute__((__used__)) = {
    [0] = {
        gpio_check_dlps,
        gpio_enter_dlps,
        gpio_exit_dlps,
        gpio_wakeup_dlps,
    },
};
#endif

static int GPIO_INPUT_HANDLER(int irq, void *context, void *arg)
{
    if (GPIO_GetINTStatus(GPIO_PIN_BUTTON_0)) {
        GPIO_INTConfig(GPIO_PIN_BUTTON_0, DISABLE);
        GPIO_MaskINTConfig(GPIO_PIN_BUTTON_0, ENABLE);

        printk("GPIO_INPUT_HANDLER %d\n", GPIO_ReadInputDataBit(GPIO_PIN_BUTTON_0));
        /* Config WakeUp pin */
        if (GPIO_ReadInputDataBit(GPIO_PIN_BUTTON_0)){
            printk("button release\n");
            static struct mible_task_item button_irq_tasklet;
            mible_single_task_post(&button_irq_tasklet, button_process_handler, NULL);

            GPIO->INTPOLARITY = GPIO->INTPOLARITY & (~GPIO_PIN_BUTTON_0);
        }else{
            printk("button press\n");
            GPIO->INTPOLARITY = (GPIO->INTPOLARITY & (~GPIO_PIN_BUTTON_0)) | GPIO_PIN_BUTTON_0;
        }
#if defined(CONFIG_PM)
        IO_DLPS_Enter_Allowed = true;
#endif
        GPIO_ClearINTPendingBit(GPIO_PIN_BUTTON_0);
        GPIO_MaskINTConfig(GPIO_PIN_BUTTON_0, DISABLE);
        GPIO_INTConfig(GPIO_PIN_BUTTON_0, ENABLE);
    }else{
        printk("GPIO_INPUT_HANDLER not BUTTON0\n");
    }

    return 0;
}

static int board_init(void)
{
    // Pad_Config(BUTTON_0, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_HIGH);
    // Pad_Config(BUTTON_1, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_HIGH);
    // Pad_Config(BUTTON_2, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_HIGH);

    Pad_Config(LED1_R, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);
    Pad_Config(LED2_G, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);
    Pad_Config(LED3_B, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);
    Pad_Config(LED4_C, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);
    Pad_Config(LED5_W, PAD_SW_MODE, PAD_IS_PWRON, PAD_PULL_NONE, PAD_OUT_ENABLE, PAD_OUT_LOW);

    /* INIT BUTTON IRQ*/
    RCC_PeriphClockCmd(APBPeriph_GPIO, APBPeriph_GPIO_CLOCK, ENABLE);

    Pad_Config(BUTTON_0, PAD_PINMUX_MODE, PAD_IS_PWRON, PAD_PULL_UP, PAD_OUT_DISABLE, PAD_OUT_HIGH);
    Pinmux_Config(BUTTON_0, DWGPIO);

    /* Config WakeUp pin */
    System_WakeUpPinEnable(BUTTON_0, PAD_WAKEUP_POL_LOW, PAD_WK_DEBOUNCE_DISABLE, 0);

    GPIO_InitTypeDef GPIO_struct_init;
    GPIO_StructInit(&GPIO_struct_init);

    GPIO_struct_init.GPIO_Pin = GPIO_PIN_BUTTON_0;
    GPIO_struct_init.GPIO_Mode = GPIO_Mode_IN;
    GPIO_struct_init.GPIO_DebounceTime = 10;
    GPIO_struct_init.GPIO_ITTrigger = GPIO_INT_Trigger_EDGE;
    GPIO_struct_init.GPIO_ITCmd = ENABLE;
    GPIO_struct_init.GPIO_ITDebounce = GPIO_INT_DEBOUNCE_ENABLE;
    GPIO_struct_init.GPIO_ITPolarity = GPIO_INT_POLARITY_ACTIVE_LOW;
    GPIO_Init(&GPIO_struct_init);

    NVIC_InitTypeDef NVIC_InitStruct;
    NVIC_InitStruct.NVIC_IRQChannel = GPIO_BUTTON0_IRQn;
    NVIC_InitStruct.NVIC_IRQChannelPriority = 3;
    NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStruct);

    GPIO_MaskINTConfig(GPIO_PIN_BUTTON_0, DISABLE);
    GPIO_INTConfig(GPIO_PIN_BUTTON_0, ENABLE);

    /* register nuttx IRQ*/
    extern void up_enable_irq(int irq);
    up_enable_irq(GPIO_Group2_VECTORn);
    irq_attach(GPIO_Group2_VECTORn, GPIO_INPUT_HANDLER, NULL);

    return 0;
}

static void user_devinfo_callback(mible_dev_info_type_t type, mible_dev_info_t *buf)
{
    static const uint8_t support_devinfo[] = {
        MIBLE_DEV_INFO_HARDWARE_VERSION,
        MIBLE_DEV_INFO_NEW_SN,
    };

    switch (type) {
    case MIBLE_DEV_INFO_SUPPORT:
        buf->len = sizeof(support_devinfo);
        memcpy(buf->buff, support_devinfo, buf->len);
        break;
    case MIBLE_DEV_INFO_HARDWARE_VERSION:
        buf->len = strlen("MHCB12G");
        memcpy(buf->buff, "MHCB12G", buf->len);
        break;
    case MIBLE_DEV_INFO_NEW_SN:
        // maxlen 62
        buf->len = MIN(strlen("1234567890abcdefghijklmn"), 62);
        memcpy(buf->buff, "1234567890abcdefghijklmn", buf->len);
        break;
    default:
        buf->code = MI_ERR_NOT_FOUND;
        return;
    }

    buf->code = MI_SUCCESS;

    return;
}

static void mible_conn_timeout_handler(void * arg)
{
    mible_status_t status;

    miio_timer_delete(conn_timer);
    conn_timer = NULL;

    if (is_logined == true) {
        return;
    }

    printk("mible conn timeout");

    status = mible_gap_disconnect(0);
    if (status) {
        printk("Unable disconnect %d", status);
    }
}

static void user_event_cb(mible_user_event_type_t event, void *user_data)
{
    static const uint8_t *const strs[] = {
        [MIBLE_USER_PROV_CB_TYPE_UNPROV] = "Unprovision",
        [MIBLE_USER_PROV_CB_TYPE_PROVED] = "Provisioned",
        [MIBLE_USER_PROV_CB_TYPE_START] = "Provision start",
        [MIBLE_USER_PROV_CB_TYPE_COMPLETE] = "Provision completed",
        [MIBLE_USER_PROV_CB_TYPE_FAIL] = "Provision failed",
        [MIBLE_USER_PROV_CB_TYPE_RESET] = "Provision Reseted",
        [MIBLE_USER_PROV_CB_TYPE_RECOVERY] = "Provision Recoveried",
        [MIBLE_USER_LOGIN_CB_TYPE_START] = "Login start",
        [MIBLE_USER_LOGIN_CB_TYPE_COMPLETE] = "Login completed",
        [MIBLE_USER_LOGIN_CB_TYPE_FAIL] = "Login failed",
        [MIBLE_USER_GAP_CB_CONNECTED] = "Connected",
        [MIBLE_USER_GAP_CB_DISCONNECTED] = "Disconnected",
        [MIBLE_USER_SCENE_CB_ADD] = "Scene added",
        [MIBLE_USER_SCENE_CB_DELETE] = "Scene deleted",
        [MIBLE_USER_SCENE_CB_RECALL] = "Scene recalled",
    };

    if (event >= ARRAY_SIZE(strs)) {
        return;
    }

    printk("%s\n", strs[event]);
    switch (event)
    {
    case MIBLE_USER_PROV_CB_TYPE_UNPROV:
        printk("MIBLE_USER_PROV_CB_TYPE_UNPROV\n");
        is_provisioned = false;
        user_scan_check();
        //TODO: stop adv after 30min or start scan for remote controller
        //mible_mesh_device_scan_set(MESH_SCAN_LOW);
        //miio_system_set_adv_timeout(1800000);
        break;
    case MIBLE_USER_PROV_CB_TYPE_FAIL:
        is_provisioned = false;
        break;
    case MIBLE_USER_PROV_CB_TYPE_START:
        break;
    case MIBLE_USER_PROV_CB_TYPE_RECOVERY:
    case MIBLE_USER_PROV_CB_TYPE_COMPLETE:
        printk("MIBLE_USER_PROV_CB_TYPE_COMPLETE\n");
        is_provisioned = true;
        user_scan_check();
        //TODO: ADD Period Power Properties
        miio_mesh_properties_period_publish_init(6, 1, 3600);
        miio_mesh_properties_period_publish_init(6, 2, 600);
        //keep adv always on
        miio_system_set_adv_timeout(0xFFFFFFFF);
        break;
    case MIBLE_USER_PROV_CB_TYPE_PROVED:
        if (reset_timer) {
            break;
        }
        printk("MIBLE_USER_PROV_CB_TYPE_PROVED\n");
        is_provisioned = true;
        user_scan_check();
        //TODO: ADD Period Power Properties
        miio_mesh_properties_period_publish_init(6, 1, 3600);
        miio_mesh_properties_period_publish_init(6, 2, 600);
        //keep adv always on
        miio_system_set_adv_timeout(0xFFFFFFFF);
        break;
    case MIBLE_USER_PROV_CB_TYPE_RESET:
        break;
    case MIBLE_USER_GAP_CB_CONNECTED:
    {
        int err;

        err = miio_timer_create(&conn_timer,
                        mible_conn_timeout_handler,
                        MIBLE_TIMER_SINGLE_SHOT);
        if (err) {
            printk("Unable create conn timeout timer");
        } else {
            miio_timer_start(conn_timer, 20000, NULL);
        }

