shan-hongzhi/MIOT-RTL8762E-B12G/vendor/xiaomi/mijia_ble_mesh/src/board/rtl8762e/main_lpn.c
        is_connected = true;
        is_logined = false;
        user_scan_check();
    }break;
    case MIBLE_USER_GAP_CB_DISCONNECTED:
    {
        if (conn_timer) {
            miio_timer_delete(conn_timer);
            conn_timer = NULL;
        }

        is_connected = false;
        is_logined = false;
        user_scan_check();
    }break;
    case MIBLE_USER_LOGIN_CB_TYPE_COMPLETE:
    {
        is_logined = true;
    }break;
    case MIBLE_USER_SCENE_CB_ADD:
    {
        //Confirmed subscribe 0xFEFE
        extern struct bt_mesh_elem elements[];
        struct bt_mesh_model *mod = &elements[0].vnd_models[0];

        uint16_t *entry = bt_mesh_model_find_group(&mod, MIBLE_MESH_DEVICE_GROUP);
        if(entry == NULL){
            entry = bt_mesh_model_find_group(&mod, BT_MESH_ADDR_UNASSIGNED);
            if(entry){
                *entry = MIBLE_MESH_DEVICE_GROUP;
                if (IS_ENABLED(CONFIG_BT_SETTINGS)) {
                    bt_mesh_model_sub_store(mod);
                }
                printk("success sub dev group addr %04x!!\n", MIBLE_MESH_DEVICE_GROUP);
            }
        }
    }break;
    default:
        break;
    }
    return;
}

static void dfu_event_cb(mible_dfu_state_t state, const mible_dfu_param_t *param)
{
    static const uint8_t *const strs[] = {
        [MIBLE_DFU_STATE_START] = "Start",
        [MIBLE_DFU_STATE_UPGRADE_STATUS] = "Upgrade Status",
        [MIBLE_DFU_STATE_TRANSFER] = "Transfer",
        [MIBLE_DFU_STATE_VERIFY] = "Verify",
        [MIBLE_DFU_STATE_SWITCH] = "Switch",
        [MIBLE_DFU_STATE_PROCESS] = "Process Report",
        [MIBLE_DFU_STATE_CANCEL] = "Cancel",
    };

    mible_dfu_param_t *p_dfu = (mible_dfu_param_t *)param;

    if (state >= ARRAY_SIZE(strs)) {
        return;
    }else if(state == MIBLE_DFU_STATE_UPGRADE_STATUS){
        p_dfu->upgrade_status.rsp = p_dfu->upgrade_status.req;
        printk("Req silent %d, install %d, Rsp silent %d, install %d\n", 
            p_dfu->upgrade_status._req.silent, p_dfu->upgrade_status._req.install,
            p_dfu->upgrade_status._rsp.silent, p_dfu->upgrade_status._rsp.install);
    }else if(state == MIBLE_DFU_STATE_VERIFY){
        printk("verify result is %d, version %u.%u.%u_%04u\n", p_dfu->verify.value,
            p_dfu->verify.version.major, p_dfu->verify.version.minor, 
            p_dfu->verify.version.revision, p_dfu->verify.version.build);
        //TODO: p_dfu->verify.value return MIBLE_DFU_STATUS_ERR_INVALID_VERSION when verion is old
    }

    printk("DFU %s\n", strs[state]);
}

static void P_1_1_Manufacturer_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
}

static void P_1_2_Model_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
}

static void P_1_3_SerialNumber_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
}

static void P_1_4_FirmwareRevision_doGet(mible_spec_bearer_t bearer,
                     mible_spec_property_operation_t *o)
{
}

static void P_2_1_On_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_boolean(&o->value, two_key_switch.left_on);
}

static void P_2_1_On_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    if (o->value.format != MIBLE_SPEC_PROPERTY_FORMAT_BOOL)
    {
        o->code = MIBLE_SPEC_OPERATION_ERROR_VALUE;
        return;
    }

    key1_onoff_set(o->value.data.boolean);
    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_2_2_Mode_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_uchar(&o->value, two_key_switch.left_mode);
}

static void P_2_2_Mode_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    if (o->value.format != MIBLE_SPEC_PROPERTY_FORMAT_UCHAR && 
        o->value.format != MIBLE_SPEC_PROPERTY_FORMAT_NUMBER)
    {
        o->code = MIBLE_SPEC_OPERATION_ERROR_VALUE;
        return;
    }

    two_key_switch.left_mode = o->value.data.ucharValue;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_2_3_Fault_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_uchar(&o->value, two_key_switch.fault);
}

static void P_2_4_Anti_Flicker_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_boolean(&o->value, two_key_switch.anti_flk);
}

static void P_2_4_Anti_Flicker_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    if (o->value.format != MIBLE_SPEC_PROPERTY_FORMAT_BOOL)
    {
        o->code = MIBLE_SPEC_OPERATION_ERROR_VALUE;
        return;
    }

    two_key_switch.anti_flk = o->value.data.boolean;
    user_scan_check();

    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_2_1_On_doAction(mible_spec_bearer_t bearer, mible_spec_action_operation_t *o)
{
    mible_spec_property_value_t value;

    if(two_key_switch.left_on){
        two_key_switch.left_on = false;
    }else{
        two_key_switch.left_on = true;
    }
    key1_onoff_set(two_key_switch.left_on);

    mible_spec_property_value_new_boolean(&value, two_key_switch.left_on);
    miio_mesh_properties_changed(2, 1, &value);

    o->vals.size = 0;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_3_1_On_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_boolean(&o->value, two_key_switch.right_on);
}

static void P_3_1_On_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    if (o->value.format != MIBLE_SPEC_PROPERTY_FORMAT_BOOL)
    {
        o->code = MIBLE_SPEC_OPERATION_ERROR_VALUE;
        return;
    }

    key2_onoff_set(o->value.data.boolean);

    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_3_2_Mode_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_uchar(&o->value, two_key_switch.right_mode);
}

static void P_3_2_Mode_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    if (o->value.format != MIBLE_SPEC_PROPERTY_FORMAT_UCHAR && 
        o->value.format != MIBLE_SPEC_PROPERTY_FORMAT_NUMBER)
    {
        o->code = MIBLE_SPEC_OPERATION_ERROR_VALUE;
        return;
    }

    two_key_switch.right_mode = o->value.data.ucharValue;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_3_1_On_doAction(mible_spec_bearer_t bearer, mible_spec_action_operation_t *o)
{
    mible_spec_property_value_t value;

    if(two_key_switch.right_on){
        two_key_switch.right_on = false;
    }else{
        two_key_switch.right_on = true;
    }
    key2_onoff_set(two_key_switch.right_on);

    mible_spec_property_value_new_boolean(&value, two_key_switch.right_on);
    miio_mesh_properties_changed(3, 1, &value);

    o->vals.size = 0;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

