shan-hongzhi/MIOT-RTL8762E-B12G/vendor/xiaomi/mijia_ble_mesh/src/board/rtl8762e/main_lpn.c
static void P_6_1_Power_Consumption_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_float(&o->value, two_key_switch.power_consumption);
    two_key_switch.power_consumption += 1.0;
}

static void P_6_2_Electric_Power_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_ushort(&o->value, two_key_switch.power_electric);
    two_key_switch.power_electric += 100;
}

static void P_6_3_Accumulation_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    mible_spec_property_value_new_boolean(&o->value, two_key_switch.accumulation);
}

static void P_7_1_Indicator_Light_doGet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
}

static void P_7_1_Indicator_Light_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
}

static void P_128_1_GMT_Offset_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    two_key_switch.gmt_offset = o->value.data.longValue;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_128_2_Weather_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    two_key_switch.weather = o->value.data.longValue;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

static void P_128_3_UTC_Time_doSet(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    two_key_switch.utc_time = o->value.data.ulongValue;
    o->code = MIBLE_SPEC_OPERATION_OK;
}

MIBLE_SPEC_DEFINE(spec_handlers)
    MIBLE_SPEC_SIID_START(1)
        MIBLE_SPEC_HANDLER(1, P_1_1_Manufacturer_doGet, NULL, NULL),
        MIBLE_SPEC_HANDLER(2, P_1_2_Model_doGet, NULL, NULL),
        MIBLE_SPEC_HANDLER(3, P_1_3_SerialNumber_doGet, NULL, NULL),
        MIBLE_SPEC_HANDLER(4, P_1_4_FirmwareRevision_doGet, NULL, NULL),
    MIBLE_SPEC_SIID_END

    MIBLE_SPEC_SIID_START(2)
        MIBLE_SPEC_HANDLER(1, P_2_1_On_doGet, P_2_1_On_doSet, P_2_1_On_doAction),
        MIBLE_SPEC_HANDLER(2, P_2_2_Mode_doGet, P_2_2_Mode_doSet, NULL),
        MIBLE_SPEC_HANDLER(3, P_2_3_Fault_doGet, NULL, NULL),
        MIBLE_SPEC_HANDLER(4, P_2_4_Anti_Flicker_doGet, P_2_4_Anti_Flicker_doSet, NULL),
    MIBLE_SPEC_SIID_END

    MIBLE_SPEC_SIID_START(3)
        MIBLE_SPEC_HANDLER(1, P_3_1_On_doGet, P_3_1_On_doSet, P_3_1_On_doAction),
        MIBLE_SPEC_HANDLER(2, P_3_2_Mode_doGet, P_3_2_Mode_doSet, NULL),
    MIBLE_SPEC_SIID_END

    MIBLE_SPEC_SIID_START(6)
        MIBLE_SPEC_HANDLER(1, P_6_1_Power_Consumption_doGet, NULL, NULL),
        MIBLE_SPEC_HANDLER(2, P_6_2_Electric_Power_doGet, NULL, NULL),
        MIBLE_SPEC_HANDLER(3, P_6_3_Accumulation_doGet, NULL, NULL),
    MIBLE_SPEC_SIID_END

    MIBLE_SPEC_SIID_START(7)
        MIBLE_SPEC_HANDLER(1, P_7_1_Indicator_Light_doGet, P_7_1_Indicator_Light_doSet, NULL),
    MIBLE_SPEC_SIID_END

    MIBLE_SPEC_SIID_START(128)
        MIBLE_SPEC_HANDLER(1, NULL, P_128_1_GMT_Offset_doSet, NULL),
        MIBLE_SPEC_HANDLER(2, NULL, P_128_2_Weather_doSet, NULL),
        MIBLE_SPEC_HANDLER(3, NULL, P_128_3_UTC_Time_doSet, NULL),
    MIBLE_SPEC_SIID_END
MIBLE_SPEC_END

static const struct mible_spec_piid_or_aiid_list *
    find_spec_handler(uint16_t siid, uint16_t piid_or_aiid)
{
    int i, j;

    for (i = 0; i < ARRAY_SIZE(spec_handlers); i++) {
        if (spec_handlers[i].siid == siid) {
            break;
        }
    }

    if (i == ARRAY_SIZE(spec_handlers)) {
        return NULL;
    }

    for (j = 0; spec_handlers[i].lists[j].piid_or_aiid != 0; j++) {
        if (spec_handlers[i].lists[j].piid_or_aiid == piid_or_aiid) {
            break;
        }
    }

    if (spec_handlers[i].lists[j].piid_or_aiid == 0) {
        return NULL;
    }

    return &spec_handlers[i].lists[j];
}

static const uint8_t *const spec_bearers[] = {
    [MIBLE_SPEC_BEARER_GATT] = "[GATT]",
    [MIBLE_SPEC_BEARER_MESH] = "[MESH]",
};

static void do_spec_get(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    const struct mible_spec_piid_or_aiid_list *i;

    if (bearer >= ARRAY_SIZE(spec_bearers)) {
        return;
    }

    printk("%s %s siid %d piid %d\n", __FUNCTION__, spec_bearers[bearer], o->siid, o->piid);

    i = find_spec_handler(o->siid, o->piid);
    if (!i || !(i->get)) {
        return;
    }

    i->get(bearer, o);
}

static void do_spec_set(mible_spec_bearer_t bearer, mible_spec_property_operation_t *o)
{
    const struct mible_spec_piid_or_aiid_list *i;

    if (bearer >= ARRAY_SIZE(spec_bearers)) {
        return;
    }

    printk("%s %s siid %d piid %d type %d val %08lx\n", __FUNCTION__, spec_bearers[bearer], 
            o->siid, o->piid, o->value.format, o->value.data.ulongValue);

    i = find_spec_handler(o->siid, o->piid);
    if (!i || !(i->set)) {
        return;
    }

    i->set(bearer, o);
}

static void do_spec_invoke(mible_spec_bearer_t bearer, mible_spec_action_operation_t *o)
{
    const struct mible_spec_piid_or_aiid_list *i;

    if (bearer >= ARRAY_SIZE(spec_bearers)) {
        return;
    }

    printk("%s %s siid %d piid %d arg[size %d]\n", __FUNCTION__, spec_bearers[bearer], o->siid, o->aiid,
           o->vals.size);

    i = find_spec_handler(o->siid, o->aiid);
    if (!i || !(i->invoke)) {
        return;
    }

    i->invoke(bearer, o);
}

#define APP_CFG_INFO __attribute__((section(".cfg"))) __attribute__((used))
const volatile struct mible_config APP_CFG_INFO mi_config = {
    .magic = 0xdeadbeef,
    .cfg =
    {
        .pid = PRODUCT_ID,
        .dev_version = DEVELOPER_VERSION,
        .model_name = MODEL_NAME,

        .gatt_spec =
        {
            .rx_buf = gatt_spec_buffer,
            .max_rx_buf_len = ARRAY_SIZE(gatt_spec_buffer),
            .max_tx_buf_len = ARRAY_SIZE(gatt_spec_buffer),
            .tx_pool = gatt_spec_pool,
            .max_tx_pool_num = ARRAY_SIZE(gatt_spec_pool),
        },

        .init = 
        {
            .gatt_spec_init = mible_gatt_spec_enable,
        #if defined(CONFIG_BT_MESH_PSK)
            .psk_init = mible_psk_auth_enable,
        #endif
        #if defined(CONFIG_BT_MESH_PATH)
            .path_init = mible_path_ota_enable,
        #endif
        },
    },
    .cb =
    {
        .dev_info.req = user_devinfo_callback,
        .event.event = user_event_cb,
        .dfu_info.event = dfu_event_cb,
        .spec.get = do_spec_get,
        .spec.set = do_spec_set,
        .spec.invoke = do_spec_invoke,
    },
};

