shan-hongzhi/MIOT-RTL8762E-B12G/vendor/xiaomi/mijia_ble_mesh/src/board/rtl8762e/main_lpn.c
uint32_t scan_count, ext_adv_cnt, lost_cnt, per_adv_cnt;

static void scan_recv(const struct bt_le_scan_recv_info *info,
            struct net_buf_simple *buf)
{
    scan_count++;
    if(info->adv_type == BT_GAP_ADV_TYPE_EXT_ADV){
        ext_adv_cnt++;
    }
}

static struct bt_le_scan_cb ext_scan_cb = {
    .recv = scan_recv,
};

static void pwr_timer_handler(void * p_context)
{
    int err;
    uint32_t pwr_cnt;

    if (!p_context) {
        miio_timer_delete(pwn_timer);
        pwn_timer = NULL;

        err = miio_record_delete(RECORD_ID_POWER_ON_COUNT);
        if (err) {
            printk("Unable to delete recoid id:0x%04x",
                      RECORD_ID_POWER_ON_COUNT);
        }

        return;
    }

    pwr_cnt = (uint32_t)p_context;

    miio_timer_start(pwn_timer, SWITCH_POWER_ON_TIME, NULL);

    err = miio_record_write(RECORD_ID_POWER_ON_COUNT,
                (uint8_t *)&pwr_cnt, sizeof(pwr_cnt));
    if (err) {
        printk("Unable to store recoid id:0x%04x",
                  RECORD_ID_POWER_ON_COUNT);
    }
}

static bool switch_flash_restore(void)
{
    uint32_t pwr_cnt = 0;
    int ret;

    ret = miio_record_read(RECORD_ID_POWER_ON_COUNT,
                   (uint8_t *)&pwr_cnt, sizeof(pwr_cnt));
    if (ret != MI_SUCCESS) {
        goto store;
    }

    printk("Power on count %ld\n", pwr_cnt);

    if (pwr_cnt >= SWITCH_POWER_ON_COUNT) {
        return true;
    }

store:
    pwr_cnt++;

    ret = miio_timer_create(&pwn_timer,
                pwr_timer_handler,
                MIBLE_TIMER_SINGLE_SHOT);
    if (ret) {
        printk("Unable to create timer for power reset");
        return false;
    }

    miio_timer_start(pwn_timer, 1000, (void *)pwr_cnt);

    return false;
}

static void node_restore_timer_handler(void * arg)
{
    int err;

    err = miio_record_delete(RECORD_ID_POWER_ON_COUNT);
    if (err) {
        printk("Unable to delete recoid id:0x%04x",
                  RECORD_ID_POWER_ON_COUNT);
    }

    //use param 0 to close recovery
    mible_mesh_restore(0);
}

static void app_periodic_handler(void * arg)
{
    struct mallinfo info;
    int err = 0;

    info = mallinfo();
    printk("Heap left:%d Scan cnt:%ld, ext cnt:%ld, per cnt %ld\n",
        info.fordblks, scan_count, ext_adv_cnt, per_adv_cnt);

    scan_count = 0;
    ext_adv_cnt = 0;
    per_adv_cnt = 0;

    err = ioctl(fd_wd, WDIOC_KEEPALIVE, 0);
    if(err < 0){
        printk("wd feed fail %d\n", err);
    }
}

/* Used for factory test */
typedef struct {
    uint8_t major;
    uint8_t minor;
    uint8_t revision;
    uint8_t padding;
    uint16_t developer_version;

    uint16_t  p;
    const uint8_t   *m;

    uint32_t magic;
} info_t;

#define APP_VERSION_INFO __attribute__((section(".info"))) __attribute__((used))

const info_t mi_info APP_VERSION_INFO = {
    .major = MIBLE_LIB_MAJOR,
    .minor = MIBLE_LIB_MINOR,
    .revision = MIBLE_LIB_REVISION,
    .developer_version = DEVELOPER_VERSION,

    .p = PRODUCT_ID,
    .m = MODEL_NAME,

    .magic = 0x12345678,
};

T_SW_RESET_REASON reset_reason_8762e(void)
{
    T_SW_RESET_REASON sw_reset_type = __rtl_reset_reason_get();
    uint32_t wdg_reset_lr = (__rtl_btaon_fast_read_safe(0x1c6) << 16) | (__rtl_btaon_fast_read_safe(0x1c4));

    if (wdg_reset_lr & 0xffff0000) {
        if (sw_reset_type == RESET_REASON_HW) {
            sw_reset_type = RESET_REASON_WDG_TIMEOUT;
        }
    } else {
        sw_reset_type = RESET_REASON_HW;
    }

    return sw_reset_type;
}

int main(int argc, FAR char *argv[])
{
    int err;

    printk("Model Name %s PID %ld Develop Version %d\n",
            mi_config.cfg.model_name, mi_config.cfg.pid, mi_config.cfg.dev_version);

    err = wdg_init();
    if (err) {
        printk("watchdog init failed (err %d)\n", err);
        return err;
    }

    err = board_init();
    if (err) {
        printk("board init failed (err %d)\n", err);
        return err;
    }

    /* let's wait for a while avoid power reset */
    // Note: delay init bt for Capacitor charging when Relay on
    // Boot time ~ 0.37s * 4.5mA, delay time ~ 2s * 0.02mA
    if (IS_ENABLED(CONFIG_PM)) {
        k_sleep(K_SECONDS(2));
    }

    extern int zblue_main(void);
    err = zblue_main();
    if (err) {
        printk("zblue init failed (err %d)\n", err);
        return err;
    }

    err = bt_enable(NULL);
    if (err) {
        printk("Bluetooth init failed (err %d)\n", err);
        return err;
    }

    err = mible_service_init();
    if (err) {
        printk("mi service init failed (err %d)\n", err);
        return err;
    }

    err = mible_mesh_start();
    if (err) {
        printk("mesh start failed (err %d)\n", err);
        return err;
    }
    bt_le_scan_cb_register(&ext_scan_cb);

    if (switch_flash_restore()) {
        printk("miio_system_restore\n");
        /* Call restore later, since mijia uninit yet.  */
        err = miio_timer_create(&reset_timer,
                    node_restore_timer_handler,
                    MIBLE_TIMER_SINGLE_SHOT);
        if (err) {
            printk("Unable to create restore timer");
            return err;
        }

        /* Indicate system restore in progress. */
        miio_timer_start(reset_timer, 1000, NULL);
    }

    err = miio_timer_create(&app_handle, app_periodic_handler,
                 MIBLE_TIMER_REPEATED);
    if (err) {
        printk("Unable to create app timer");
        return err;
    }
    miio_timer_start(app_handle, 5000, NULL);

#if defined(CONFIG_BT_MESH_STATISTIC)
    mible_trace_update_reboot_reason(reset_reason_8762e());
    mible_trace_init();
#endif

    while (1) {
        mible_events_process();
    }

    return 0;
}
